In [1]:
import pandas as pd

In [2]:
pd.read_excel(r"C:\Users\HP\OneDrive\Desktop\MyExcelData.xlsx")

    Name  Roll no      Batch      Mob No
0    Ram      564  Python-09  9876568863
1  Shyam      456  Python-09  9654347860
2  Mohan      236  Python-01  7843235648
3   Ravi      876  Python-01  8854347890

In [6]:
pd.read_csv(r"C:\Users\HP\OneDrive\Desktop\MyCSVFile1.csv")

     Name  Roll No    Rank             Email Id
0     Ram      564     5th     Ram123@gmail.com
1   Shyam      879     3rd   Shyam879@gmail.com
2  Keshav      342    1st   Keshav471@gmail.com
3   Murli      547     4th   Murli531@gmail.com

In [16]:
pd.read_csv(r"C:\Users\HP\OneDrive\Desktop\MyFile.TSV",sep="\t")

        Name Roll Batch Grade
0        Ram  980   X01     A
1  Shyam 230  X02     B   NaN
2      Mohan  546   X03     c
3   Ravi 356  X04     D   NaN